Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# AdvancedSetting.rightJustifyRTLLines
source: Right-justify lines in paragraphs with base writing direction of right-to-left? Requires BOTH “right-to-left text support” and “auto-detect paragraph writing detection” to be enabled.
de: Zeilen in Absätzen mit rechts-nach-links-Grundschreibrichtung rechtsbündig ausrichten? Erfordert, dass SOWOHL „Unterstützung für Rechts-nach-links-Text“ ALS AUCH „Automatische Erkennung der Absatzschreibrichtung“ aktiviert sind.
ja: 基本の書字方向が右から左の段落で、行を右揃えにするか？ 「右から左のテキストサポート」と「段落の書字方向を自動検出」の両方が有効である必要があります。
pt_br: Justificar à direita as linhas em parágrafos com direção de escrita base da direita para a esquerda? Requer que TANTO “suporte a texto da direita para a esquerda” QUANTO “detecção automática de direção de escrita de parágrafo” estejam ativados.
ru: Выравнивать по правому краю строки в абзацах с направлением письма справа налево? Требует, чтобы были включены ОБА параметра: «поддержка текста справа налево» и «автоопределение направления письма абзаца».
zh_hans: 当段落的基线书写方向为从右到左时，是否左右对齐行？ 需要同时启用“从右到左文本支持”和“自动检测段落书写检测”。

# AdvancedSetting.runJobsInServers
source: Enable session restoration. Session restoration runs jobs in separate processes. They will survive crashes, force quits, and upgrades. You must restart iTerm2 for this change to take effect.
de: Sitzungswiederherstellung aktivieren. Bei der Sitzungswiederherstellung laufen Jobs in separaten Prozessen. Sie überstehen Abstürze, erzwungenes Beenden und Aktualisierungen. Sie müssen iTerm2 neu starten, damit diese Änderung wirksam wird.
ja: セッション復元を有効にする。 セッション復元は、ジョブを別プロセスで実行します。これによりクラッシュ、強制終了、アップグレードを乗り越えてジョブが存続します。 この変更を反映させるにはiTerm2を再起動する必要があります。
pt_br: Ativar a restauração de sessão. A restauração de sessão executa tarefas em processos separados. Eles sobreviverão a falhas, encerramentos forçados e atualizações. Você precisa reiniciar o iTerm2 para que esta alteração tenha efeito.
ru: Включить восстановление сеансов. При восстановлении сеансов задачи выполняются в отдельных процессах. Они переживут сбои, принудительное завершение и обновления. Чтобы изменение этого параметра вступило в силу, необходимо перезапустить iTerm2.
zh_hans: 启用会话恢复。 会话恢复会在独立进程中运行任务，这些任务能在崩溃、强制退出和升级中存活。 必须重启iTerm2才能生效。

# AdvancedSetting.saveProfilesToRecentDocuments
source: Add items to Recents (in the dock icon's menu) to reopen recently used profiles as tabs?
de: Einträge zu „Zuletzt verwendet“ (im Menü des Dock-Symbols) hinzufügen, um kürzlich verwendete Profile als Tabs erneut zu öffnen?
ja: 最近使用したプロファイルをタブとして再度開けるように、Dockアイコンのメニューの「最近使った項目」に追加するか？
pt_br: Adicionar itens aos Recentes (no menu do ícone do dock) para reabrir perfis usados recentemente como abas?
ru: Добавлять элементы в «Последние» (в меню значка в Dock) для повторного открытия недавно использованных профилей в виде вкладок?
zh_hans: 是否将项目添加到Recents（在 Dock图标菜单中），以便重新打开最近使用的配置文件作为标签页？

# AdvancedSetting.saveScrollbackWhenCursorMovesAbovePrompt
source: Save the screen to scrollback when an app moves the cursor above the prompt. Some full-screen programs that don’t use the alternate screen buffer repaint by moving the cursor to the top of the screen and overwriting whatever was already there, destroying content you can still see. When enabled, iTerm2 first scrolls the visible screen into history so that content isn’t lost. Requires shell integration.
de: Bildschirm in den Scrollback-Verlauf speichern, wenn eine App den Cursor über die Eingabeaufforderung bewegt. Manche Vollbildprogramme, die nicht den alternativen Bildschirmpuffer verwenden, zeichnen neu, indem sie den Cursor an den oberen Bildschirmrand bewegen und dort bereits vorhandene Inhalte überschreiben, wodurch noch sichtbarer Inhalt zerstört wird. Bei Aktivierung verschiebt iTerm2 zunächst den sichtbaren Bildschirm in den Verlauf, damit kein Inhalt verloren geht. Erfordert Shell Integration.
ja: アプリがカーソルをプロンプトより上に移動したとき、画面をスクロールバックに保存する。 一部のフルスクリーンプログラムは、代替スクリーンバッファを使わずにカーソルを画面の一番上に移動して再描画を行い、まだ表示されていた内容を上書きして消してしまいます。有効にすると、iTerm2はコンテンツが失われないよう、まず表示中の画面を履歴にスクロールします。Shell Integrationが必要です。
pt_br: Salvar a tela no histórico de rolagem quando um app move o cursor acima do prompt. Alguns programas de tela cheia que não usam o buffer de tela alternativo redesenham movendo o cursor para o topo da tela e sobrescrevendo o que já estava lá, destruindo conteúdo que você ainda pode ver. Quando ativado, o iTerm2 primeiro rola a tela visível para o histórico para que o conteúdo não seja perdido. Requer o Shell Integration.
ru: Сохранять экран в историю прокрутки, когда приложение перемещает курсор выше приглашения. Некоторые полноэкранные программы, не использующие альтернативный экранный буфер, перерисовывают экран, перемещая курсор в начало экрана и перезаписывая уже имеющееся там содержимое, уничтожая то, что всё ещё видно. Если включено, iTerm2 сначала прокручивает видимый экран в историю, чтобы содержимое не терялось. Требуется Shell Integration.
zh_hans: 当应用将光标移出提示符上方时，是否将屏幕保存到滚动缓冲区？ 某些全屏程序不使用备用屏幕缓冲，而是通过将光标移动到屏幕顶部并覆盖现有内容来重新绘制，从而破坏仍可看到的内容。启用后，iTerm2会先将可见屏幕滚动到历史记录中，避免内容丢失。需要shell集成。

# AdvancedSetting.saveScrollBufferWhenClearing
source: Save scroll buffer when clearing screen. When enabled, saves the current screen into scroll back buffer instead of clearing it.
de: Scroll-Puffer beim Leeren des Bildschirms speichern. Bei Aktivierung wird der aktuelle Bildschirm in den Scrollback-Puffer gespeichert, anstatt ihn zu leeren.
ja: 画面をクリアする際にスクロールバッファを保存する。 有効にすると、画面をクリアする代わりに現在の画面をスクロールバックバッファに保存します。
pt_br: Salvar o buffer de rolagem ao limpar a tela. Quando ativado, salva a tela atual no buffer de histórico de rolagem em vez de limpá-la.
ru: Сохранять буфер прокрутки при очистке экрана. Если включено, сохраняет текущий экран в буфер прокрутки вместо его очистки.
zh_hans: 在清除屏幕时是否保存滚动缓冲区。 启用后，将当前屏幕保存到滚动缓冲区中，而不是清空它。

# AdvancedSetting.saveToPasteHistoryWhenSecureInputEnabled
source: Save to paste history when secure keyboard input is enabled?
de: Im Einfügeverlauf speichern, wenn sichere Tastatureingabe aktiviert ist?
ja: セキュアキーボード入力が有効な場合にPaste Historyへ保存するか？
pt_br: Salvar no histórico de colagem quando a entrada segura de teclado está ativada?
ru: Сохранять в историю вставок, когда включён безопасный ввод с клавиатуры?
zh_hans: 在启用安全键盘输入时，是否保存到粘贴历史中？

# AdvancedSetting.screenshotMaxPixelHeight
source: Maximum pixel height for a single screenshot file. Screenshots taller than this will be split into multiple files. Also affects the maximum total pixels (this value squared / 5).
de: Maximale Pixelhöhe für eine einzelne Screenshot-Datei. Screenshots, die höher sind, werden auf mehrere Dateien aufgeteilt. Beeinflusst auch die maximale Gesamtpixelzahl (dieser Wert zum Quadrat / 5).
ja: スクリーンショット1ファイルあたりの最大ピクセル高。 これより高いスクリーンショットは複数のファイルに分割されます。最大合計ピクセル数（この値の2乗を5で割った値）にも影響します。
pt_br: Altura máxima em pixels para um único arquivo de captura de tela. Capturas de tela mais altas que isto serão divididas em múltiplos arquivos. Também afeta o total máximo de pixels (este valor ao quadrado / 5).
ru: Максимальная высота в пикселях для одного файла скриншота. Скриншоты выше этого значения будут разделены на несколько файлов. Также влияет на максимальное общее число пикселей (это значение в квадрате, делённое на 5).
zh_hans: 单个截图文件的最大像素高度。 高于此高度的截图将拆分为多个文件。也影响最大总像素数（该值的平方除以5）。

# AdvancedSetting.screenshotSaveLocation
source: Folder where the “Save” button in the screenshot window writes files. Leave empty to save to the Desktop. The “Save As…” button ignores this and always prompts for a location.
de: Ordner, in den die Schaltfläche „Sichern“ im Screenshot-Fenster Dateien schreibt. Leer lassen, um auf dem Schreibtisch zu sichern. Die Schaltfläche „Sichern unter…“ ignoriert dies und fragt immer nach einem Speicherort.
ja: スクリーンショットウィンドウの「保存」ボタンがファイルを書き込むフォルダ。 空欄の場合はデスクトップに保存されます。「名前を付けて保存…」ボタンはこの設定を無視し、常に保存場所を尋ねます。
pt_br: Pasta onde o botão “Salvar” na janela de captura de tela grava os arquivos. Deixe vazio para salvar na Mesa. O botão “Salvar como…” ignora isto e sempre solicita um local.
ru: Папка, в которую кнопка «Сохранить» в окне скриншота записывает файлы. Оставьте пустым, чтобы сохранять на рабочий стол. Кнопка «Сохранить как…» игнорирует этот параметр и всегда запрашивает расположение.
zh_hans: 截图窗口中“保存”按钮写入文件的文件夹。 留空则保存到桌面。“另存为…”按钮忽略此设置，始终会提示位置。

# AdvancedSetting.scrollableTabWidth
source: Tab width when the tab bar is scrollable. Used as the fixed width when tabs are equally sized, and as the minimum width when uneven tab widths are allowed.
de: Tab-Breite, wenn die Tableiste scrollbar ist. Wird als feste Breite verwendet, wenn Tabs gleich groß sind, und als Mindestbreite, wenn ungleichmäßige Tab-Breiten zulässig sind.
ja: タブバーがスクロール可能なときのタブ幅。 タブが均等なサイズのときは固定幅として、不均一なタブ幅が許可されている場合は最小幅として使用されます。
pt_br: Largura da aba quando a barra de abas é rolável. Usada como a largura fixa quando as abas têm o mesmo tamanho, e como a largura mínima quando larguras de abas desiguais são permitidas.
ru: Ширина вкладки, когда панель вкладок прокручиваемая. Используется как фиксированная ширина, когда все вкладки одинакового размера, и как минимальная ширина, когда допускается неравная ширина вкладок.
zh_hans: 标签页栏可滚动时的标签宽度。 作为等宽标签的固定宽度，以及非等宽标签的最小宽度。

# AdvancedSetting.scrollWheelAcceleration
source: Speed up scroll gestures by this factor.
de: Scroll-Gesten um diesen Faktor beschleunigen.
ja: スクロールジェスチャーの速度をこの倍率で加速する。
pt_br: Acelerar os gestos de rolagem por este fator.
ru: Ускорять жесты прокрутки в указанное число раз.
zh_hans: 滚动手势的加速倍数。

# AdvancedSetting.searchCommand
source: Template for URL of search engine. iTerm2 replaces the string “%@” with the text to search for. Query parameter percent escaping is used.
de: Vorlage für die URL der Suchmaschine. iTerm2 ersetzt den String „%@“ durch den gesuchten Text. Dabei wird Prozent-Escaping für Abfrageparameter verwendet.
ja: 検索エンジンのURLテンプレート。 iTerm2は文字列「%@」を検索対象のテキストに置き換えます。クエリパラメータのパーセントエスケープが使用されます。
pt_br: Modelo para a URL do mecanismo de busca. O iTerm2 substitui a string “%@” pelo texto a buscar. É usado o escape de porcentagem para parâmetros de consulta.
ru: Шаблон URL-адреса поисковой системы. iTerm2 заменяет строку «%@» на текст для поиска. Используется процентное экранирование параметра запроса.
zh_hans: 搜索引擎URL的模板。 iTerm2将字符串“%@”替换为搜索文本，使用查询参数百分比转义。

# AdvancedSetting.searchSuggestURL
source: Template of URL for typeahead search suggestions. iTerm replaces the string “%@” with the text to search for. Query parameter percent escaping is used.
de: Vorlage der URL für Typeahead-Suchvorschläge. iTerm ersetzt den String „%@“ durch den gesuchten Text. Dabei wird Prozent-Escaping für Abfrageparameter verwendet.
ja: 先読み検索候補のURLテンプレート。 iTermは文字列「%@」を検索対象のテキストに置き換えます。クエリパラメータのパーセントエスケープが使用されます。
pt_br: Modelo de URL para sugestões de busca antecipada. O iTerm substitui a string “%@” pelo texto a buscar. É usado o escape de porcentagem para parâmetros de consulta.
ru: Шаблон URL-адреса для подсказок поиска при вводе. iTerm2 заменяет строку «%@» на текст для поиска. Используется процентное экранирование параметра запроса.
zh_hans: 类型提示搜索建议的URL模板。 iTerm将字符串“%@”替换为搜索文本，使用查询参数百分比转义。

# AdvancedSetting.selectsTabsOnMouseDown
source: Select tabs on mouse-down? Changing this setting will not affect existing windows.
de: Tabs bei Mausklick (Mouse-Down) auswählen? Das Ändern dieser Einstellung wirkt sich nicht auf bestehende Fenster aus.
ja: マウスボタンを押した時点でタブを選択するか？ この設定の変更は既存のウィンドウには影響しません。
pt_br: Selecionar abas ao pressionar o mouse? Alterar este ajuste não afetará as janelas existentes.
ru: Выбирать вкладки при нажатии кнопки мыши (mouse-down)? Изменение этого параметра не повлияет на уже открытые окна.
zh_hans: 鼠标按下时选择标签页？ 更改此设置不会影响现有窗口。

# AdvancedSetting.sensitiveScrollWheel
source: Scroll on any scroll wheel movement, no matter how small?
de: Bei jeder Mausradbewegung scrollen, egal wie klein?
ja: どんなに小さなスクロールホイールの動きでもスクロールするか？
pt_br: Rolar a qualquer movimento da roda de rolagem, por menor que seja?
ru: Прокручивать при любом, даже самом малом, движении колеса мыши?
zh_hans: 无论移动多小，使用滚动轮滚动时是否响应？

# AdvancedSetting.serializeOpeningMultipleFullScreenWindows
source: When opening multiple fullscreen windows, enter fullscreen one window at a time.
de: Beim Öffnen mehrerer Vollbildfenster jeweils nur ein Fenster nach dem anderen in den Vollbildmodus versetzen.
ja: 複数のフルスクリーンウィンドウを開くとき、1つずつ順番にフルスクリーンにする。
pt_br: Ao abrir múltiplas janelas em tela cheia, entrar em tela cheia uma janela de cada vez.
ru: При открытии нескольких полноэкранных окон переводить их в полноэкранный режим по одному.
zh_hans: 打开多个全屏窗口时，一次仅打开一个全屏窗口。

# AdvancedSetting.sessionEndMessageDividerCharacter
source: Character to use for divider lines in session end messages. Leave empty to use secure default (BrokenPipeDivider image). Examples: ━ ─ ═ ╌ ┄
de: Zeichen für Trennlinien in Meldungen zum Sitzungsende. Leer lassen, um den sicheren Standard (BrokenPipeDivider-Bild) zu verwenden. Beispiele: ━ ─ ═ ╌ ┄
ja: セッション終了メッセージの区切り線に使用する文字。空欄の場合は安全なデフォルト（BrokenPipeDivider画像）を使用します。例：━ ─ ═ ╌ ┄
pt_br: Caractere a usar nas linhas divisórias das mensagens de fim de sessão. Deixe vazio para usar o padrão seguro (imagem BrokenPipeDivider). Exemplos: ━ ─ ═ ╌ ┄
ru: Символ для линий-разделителей в сообщениях о завершении сеанса. Оставьте пустым, чтобы использовать безопасное значение по умолчанию (изображение BrokenPipeDivider). Примеры: ━ ─ ═ ╌ ┄
zh_hans: 会话结束消息中用于分隔线的字符。留空则使用默认安全分隔符（BrokenPipeDivider图像）。示例： ━ ─ ═ ╌ ┄

# AdvancedSetting.sessionEndMessageText
source: Text displayed when a session ends. Leave empty to use default.
de: Text, der beim Beenden einer Sitzung angezeigt wird. Leer lassen, um den Standard zu verwenden.
ja: セッション終了時に表示するテキスト。空欄の場合はデフォルトを使用します。
pt_br: Texto exibido quando uma sessão termina. Deixe vazio para usar o padrão.
ru: Текст, отображаемый при завершении сеанса. Оставьте пустым, чтобы использовать значение по умолчанию.
zh_hans: 会话结束时显示的文本。留空则使用默认。

# AdvancedSetting.sessionFinishedMessageText
source: Text displayed when a short-lived session finishes.
de: Text, der beim Beenden einer kurzlebigen Sitzung angezeigt wird.
ja: 短命なセッションが終了したときに表示するテキスト。
pt_br: Texto exibido quando uma sessão de curta duração termina.
ru: Текст, отображаемый по завершении недолгого сеанса.
zh_hans: 短暂会话结束时显示的文本。

# AdvancedSetting.sessionRestartedMessageText
source: Text displayed when a session is restarted.
de: Text, der beim Neustart einer Sitzung angezeigt wird.
ja: セッションが再起動されたときに表示するテキスト。
pt_br: Texto exibido quando uma sessão é reiniciada.
ru: Текст, отображаемый при перезапуске сеанса.
zh_hans: 会话重新启动时显示的文本。

# AdvancedSetting.setCookie
source: Set ITERM2_COOKIE environment variable, allowing Python scripts to be launched without confirmation? This will only affect sessions created after changing this setting.
de: Umgebungsvariable ITERM2_COOKIE setzen, damit Python-Skripte ohne Bestätigung gestartet werden können? Dies wirkt sich nur auf Sitzungen aus, die nach dem Ändern dieser Einstellung erstellt werden.
ja: ITERM2_COOKIE環境変数を設定し、Pythonスクリプトを確認なしで起動できるようにするか？ これはこの設定を変更した後に作成されたセッションにのみ影響します。
pt_br: Definir a variável de ambiente ITERM2_COOKIE, permitindo que scripts do Python sejam iniciados sem confirmação? Isto afetará apenas as sessões criadas após alterar este ajuste.
ru: Задавать переменную окружения ITERM2_COOKIE, позволяющую запускать сценарии Python без подтверждения? Это повлияет только на сеансы, созданные после изменения этого параметра.
zh_hans: 设置ITERM2_COOKIE环境变量，使Python脚本无需确认即可启动？ 仅影响更改后创建的会话。

# AdvancedSetting.setIT2AppPath
source: Set IT2_APP_PATH environment variable on new sessions, pointing at this iTerm2 build’s app bundle? This disambiguates the AppleScript target when multiple iTerm2 builds with the same bundle identifier are running, so that the “it2” CLI requests its cookie from this iTerm2 instance. Intended for iTerm2 developers. Only affects sessions created after changing this setting.
de: Umgebungsvariable IT2_APP_PATH bei neuen Sitzungen setzen, die auf das App-Bundle dieses iTerm2-Builds verweist? Dies löst Mehrdeutigkeiten beim AppleScript-Ziel auf, wenn mehrere iTerm2-Builds mit derselben Bundle-ID laufen, sodass die „it2“-CLI ihren Cookie von dieser iTerm2-Instanz anfordert. Für iTerm2-Entwickler gedacht. Wirkt sich nur auf Sitzungen aus, die nach dem Ändern dieser Einstellung erstellt werden.
ja: 新しいセッションにIT2_APP_PATH環境変数を設定し、このiTerm2ビルドのアプリバンドルを指すようにするか？ これは、同じバンドル識別子を持つ複数のiTerm2ビルドが実行されている場合にAppleScriptのターゲットを明確にし、「it2」CLIがこのiTerm2インスタンスからCookieを要求するようにします。iTerm2開発者向けです。この設定を変更した後に作成されたセッションにのみ影響します。
pt_br: Definir a variável de ambiente IT2_APP_PATH em novas sessões, apontando para o app bundle deste build do iTerm2? Isto desambigua o alvo do AppleScript quando múltiplos builds do iTerm2 com o mesmo identificador de bundle estão em execução, para que a CLI “it2” solicite seu cookie a esta instância do iTerm2. Destinado a desenvolvedores do iTerm2. Afeta apenas as sessões criadas após alterar este ajuste.
ru: Задавать переменную окружения IT2_APP_PATH в новых сеансах, указывающую на пакет приложения этой сборки iTerm2? Это устраняет неоднозначность цели AppleScript, когда одновременно запущено несколько сборок iTerm2 с одинаковым идентификатором пакета, чтобы CLI «it2» запрашивал cookie именно у этого экземпляра iTerm2. Предназначено для разработчиков iTerm2. Влияет только на сеансы, созданные после изменения этого параметра.
zh_hans: 在新会话中设置IT2_APP_PATH环境变量，指向此iTerm2版本的应用包？ 当多个具有相同包标识符的iTerm2版本运行时，此设置可避免AppleScript冲突，使“it2”CLI从该实例获取cookie。适用于iTerm2开发者，仅影响更改后创建的会话。

# AdvancedSetting.shortLivedSessionDuration
source: Warn about short-lived sessions that live less than this many seconds.
de: Vor kurzlebigen Sitzungen warnen, die weniger als diese Anzahl an Sekunden bestehen.
ja: この秒数未満で終了する短命なセッションについて警告する。
pt_br: Avisar sobre sessões de curta duração que duram menos que este número de segundos.
ru: Предупреждать о недолгих сеансах, которые длятся меньше указанного числа секунд.
zh_hans: 警告持续时间少于此值的短暂会话。

# AdvancedSetting.shouldSetLCTerminal
source: Set LC_TERMINAL=iTerm2. openssh and mosh pass this to hosts you connect to. It communicates the current terminal emulator. This is useful for enabling terminal emulator-specific features.
de: LC_TERMINAL=iTerm2 setzen. openssh und mosh geben dies an die Hosts weiter, mit denen Sie sich verbinden. Es teilt den aktuellen Terminalemulator mit. Dies ist nützlich, um terminalemulator-spezifische Funktionen zu aktivieren.
ja: LC_TERMINAL=iTerm2を設定する。 opensshとmoshはこれを接続先のホストに渡します。これにより現在のターミナルエミュレータが伝えられ、ターミナルエミュレータ固有の機能を有効にするのに役立ちます。
pt_br: Definir LC_TERMINAL=iTerm2. O openssh e o mosh passam isto para os hosts aos quais você se conecta. Comunica o emulador de terminal atual. Isto é útil para ativar recursos específicos do emulador de terminal.
ru: Задавать LC_TERMINAL=iTerm2. openssh и mosh передают это значение хостам, к которым вы подключаетесь. Оно сообщает, какой используется эмулятор терминала. Это полезно для включения функций, специфичных для конкретного эмулятора терминала.
zh_hans: 设置LC_TERMINAL=iTerm2。 openssh和mosh将此传递给连接的主机，用于通信当前终端仿真器，有助于启用特定于终端仿真器的功能。

# AdvancedSetting.shouldSetTerminfoDirs
source: Set $TERMINFO_DIRS to add modern terminal features to xterm-like $TERMs? iTerm2 ships with extended terminfo capabilities for common TERMs (xterm, xterm-new, and xterm-256color). For example, it enables undercurl. New sessions get created with a TERMINFO_DIRS that make the customized TERMINFOs take precedence over the system defaults.
de: $TERMINFO_DIRS setzen, um moderne Terminalfunktionen zu xterm-ähnlichen $TERMs hinzuzufügen? iTerm2 wird mit erweiterten terminfo-Fähigkeiten für gängige TERMs (xterm, xterm-new und xterm-256color) ausgeliefert. Zum Beispiel aktiviert dies Undercurl. Neue Sitzungen werden mit einem TERMINFO_DIRS erstellt, das die angepassten TERMINFOs vor den Systemstandards priorisiert.
ja: xterm系の$TERMに最新のターミナル機能を追加するために$TERMINFO_DIRSを設定するか？ iTerm2は一般的な$TERM（xterm、xterm-new、xterm-256color）向けに拡張されたterminfo機能を同梱しています。例えば、これによりアンダーカールが有効になります。新しいセッションは、カスタマイズされたTERMINFOがシステムのデフォルトより優先されるTERMINFO_DIRSで作成されます。
pt_br: Definir $TERMINFO_DIRS para adicionar recursos modernos de terminal a $TERMs semelhantes ao xterm? O iTerm2 vem com recursos de terminfo estendidos para TERMs comuns (xterm, xterm-new e xterm-256color). Por exemplo, ele ativa o undercurl. Novas sessões são criadas com um TERMINFO_DIRS que faz os TERMINFOs personalizados terem precedência sobre os padrões do sistema.
ru: Задавать $TERMINFO_DIRS, чтобы добавить современные возможности терминала для значений $TERM типа xterm? iTerm2 поставляется с расширенными возможностями terminfo для распространённых значений $TERM (xterm, xterm-new и xterm-256color). Например, это включает волнистое подчёркивание (undercurl). Новые сеансы создаются с TERMINFO_DIRS, благодаря чему настроенные terminfo имеют приоритет над системными значениями по умолчанию.
zh_hans: 设置$TERMINFO_DIRS以将现代终端功能添加到类似xterm的$TERMs？ iTerm2包含常见TERM（xterm、xterm-new和xterm-256color）的扩展terminfo功能，例如支持undercurl。新会话会创建带有TERMINFO_DIRS的会话，使自定义TERMINFO优先于系统默认设置。

# AdvancedSetting.showAutomaticProfileSwitchingBanner
source: Show a “Switched to profile” message when Automatic Profile Switching activates.
de: Eine Meldung „Zu Profil gewechselt“ anzeigen, wenn Automatic Profile Switching aktiviert wird.
ja: Automatic Profile Switchingが動作した際に「プロファイルを切り替えました」というメッセージを表示する。
pt_br: Mostrar uma mensagem “Alternou para o perfil” quando a troca automática de perfil for ativada.
ru: Показывать сообщение «Профиль изменён на» при срабатывании автоматического переключения профилей.
zh_hans: 自动配置文件切换激活时显示“已切换到配置文件”消息。

# AdvancedSetting.showBlockBoundaries
source: Show line buffer block boundaries (issue 6207)
de: Blockgrenzen des Zeilenpuffers anzeigen (Issue 6207)
ja: ラインバッファのブロック境界を表示する（issue 6207）
pt_br: Mostrar limites de bloco do buffer de linha (issue 6207)
ru: Показывать границы блоков буфера строк (issue 6207)
zh_hans: 显示行缓冲区块边界（问题6207）。

# AdvancedSetting.showButtonsForSelectedCommand
source: Show buttons at the top of a selected command? When you select a command by single clicking the command line or its output, buttons are shown on the top right with options like Copy and Share. Note that this setting only applies when marks are not “line style” such as when using Auto Composer.
de: Schaltflächen oben bei einem ausgewählten Befehl anzeigen? Wenn Sie einen Befehl durch einfaches Klicken auf die Befehlszeile oder deren Ausgabe auswählen, werden oben rechts Schaltflächen mit Optionen wie „Kopieren“ und „Teilen“ angezeigt. Beachten Sie, dass diese Einstellung nur gilt, wenn Markierungen nicht im „Zeilenstil“ sind, wie es bei Verwendung von Auto Composer der Fall ist.
ja: 選択中のコマンドの上部にボタンを表示するか？ コマンドラインまたはその出力を1回クリックしてコマンドを選択すると、右上にコピーや共有などのオプションを持つボタンが表示されます。この設定は、Auto Composerを使用する場合など、マークが「行スタイル」でない場合にのみ適用されることに注意してください。
pt_br: Mostrar botões no topo de um comando selecionado? Quando você seleciona um comando com um único clique na linha de comando ou na sua saída, botões são exibidos no canto superior direito com opções como Copiar e Compartilhar. Observe que este ajuste só se aplica quando as marcas não são de “estilo de linha”, como ao usar o Auto Compositor.
ru: Показывать кнопки над выбранной командой? При выборе команды одиночным щелчком по командной строке или её выводу в верхнем правом углу появляются кнопки с такими действиями, как «Копировать» и «Поделиться». Обратите внимание, что этот параметр действует только тогда, когда метки не «строчного» стиля, например при использовании Автокомпозера.
zh_hans: 在所选命令顶部显示按钮？ 当通过点击命令行或其输出内容选择命令时，右上角会显示“复制与分享”等选项按钮。请注意，此设置仅在标记不是“行样式”（如使用自动 composer 时）的情况下生效。
